Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: At times I can't understand him.
hi: मैं कभी-कभी उसको समझ नहीं पाती।

source: He said the words in a very small voice.
hi: उसने वह बात बहुत हल्की आवाज़ में कही।

source: The scar on his cheek hardly shows now.
hi: उसकी गाल पर जो चोट का निशान है वह अब बहुत हल्का हो गया है।

source: I'm anxious about his safety.
hi: मैं उसकी सुरक्षा के लिए परेशान हूँ।

source: His opinion is right to some extent.
hi: उसकी राय कुछ हद तक सही है।

source: His doctor told him not to drink alcohol.
hi: उसके डाक्टर ने उसे मद्य पीने से मना किया।

source: He wiped the sweat from his forehead.
hi: उसने अपने माथे से पसीना पोंछा।

source: I doubt the veracity of his statement.
hi: मुझे उसके बयान की सच्चाई पर शक़ है।

source: The mud clung to his shoes.
hi: उसके जूतों पर कीचड़ लगी हुई थी।

source: His shoes were so old that his toes were sticking out of them.
hi: उसके जूते इतने पुराने थे कि उनमें से उसकी ऊँगलियाँ निकल रहीं थीं।

source: His plan is still in the air.
hi: उसका प्लान अभी भी हवा में ही है।

source: His dog follows him wherever he goes.
hi: वह जहाँ भी जाता है, उसका कुत्ता उसके पीछे पीछे जाता है।

source: I doubt the truth of his statement.
hi: मुझे उसके बयान की सच्चाई पर शक है।

source: Not a word he says is worthy to be heard.
hi: उसका कहा हुआ एक शब्द भी सुनने लायक नहीं है।

source: I think that he is right.
hi: मुझे लगता है वह सही है।

source: What is his nationality?
hi: उसकी राष्ट्रीयता क्या है?

source: His wife comes from California.
hi: उसकी बीवी कैलिफ़ोर्निया से है।

source: There is no future in his job.
hi: उसकी नौकरी का कोई भविष्य नहीं है।

source: Ten years have gone by since his death.
hi: उसके मरने के बाद अब दस साल गुज़र चुके हैं।

source: His office is going to be shut down for want of money.
hi: उसका दफ़्तर पैसे की कमी की वजह से बंद हो जाने वाला है।

source: His failure has nothing to do with me.
hi: उसकी नाकामयाबी से मेरा कोई लेना-देना नहीं है।

source: We are disturbing him.
hi: हम उनको परेशान कर रहें हैं।

source: We must consider his youth.
hi: हमे उसकी जवानी का लिहाज करना चाहिए।

source: I have to answer his letter.
hi: मुझे उसकी चिट्ठी का जवाब देना है।

source: I went to his place straight away.
hi: मैं तुरंत उसके वहाँ गया।

source: His novels are, for the most part, very boring.
hi: उसके उपन्यास, अधिकतर, बहुत उबाऊ हैं।

source: His new book is going to come out next month.
hi: उसकी नई किताब अगले महीने छपेगी।

source: His main object in life was to become rich.
hi: उसका ज़िन्दगी में एक की उद्देश्य था और वह था अमीर बन जाना।

source: His success is out of question.
hi: उसकी कामयाबी सवाल से बाहर है।

source: His statement runs as follows.
hi: उसका बयान यह है।

source: Don't talk about it in front of him.
hi: उसके सामने इसके बारे में बात मत करो।

source: His son is lazy and good for nothing.
hi: उसका बेटा आलसी और निकम्मा है।

source: He has long legs.
hi: उसके पैर लम्बे हैं।

source: He was burning with fever.
hi: वह बुखार से जल रहा था।

source: His birthday is August 21st.
hi: उसका जन्मदिन इक्कीस अगस्त को है।

source: His long speech bored us all.
hi: उसका लम्बा भाषण सुनकर हम सब बोर हो गए।

source: I agree to his proposal.
hi: मैं उसके प्रस्ताव को स्वीकार करता हूँ।

source: His sudden death surprised us greatly.
hi: उसकी अचानक मौत ने हम सब को चौंका दिया।

source: His clothes always smell bad.
hi: उसके कपड़े हमेशा बदबू करतें हैं।

source: His mother compelled him to do his homework.
hi: उसकी माँ ने उसे अपना होमेवोर्क करने के लिए मजबूर किया.

source: She complained to me of his rudeness.
hi: उसने मुझसे उसकी असभ्यता के बारे में शिक़ायत करी।

source: I forget his name.
hi: मैं उसका नाम भूलता हूं।

source: I deny his request.
hi: मैं उसकी माँग से इनकार करता हूँ।

source: His story may not be true.
hi: हो सकता है कि उसकी कहानी सच न हो।

source: Listening to him, she got tired.
hi: उसकी बात सुनते-सुनते वह थक गयी।

source: He cut the envelope open.
hi: उसने लिफ़ाफ़े को काटकर खोल दिया।

source: He seems to be rich.
hi: वह दिखने में बहुत अमीर लगता है।

source: He is able to speak ten languages.
hi: वह दस भाषाएँ बोलना जानता है।

source: He has the ability to speak ten languages.
hi: वह दस भाषाएँ बोलना जानता है।

source: He left for New York a week ago.
hi: वह एक सप्ताह पूर्व निऊ यारक के लिए रवाना हो गया था।

source: He took a day off.
hi: उसने एक दिन की छुट्टी ली।

source: He will come home in a few days.
hi: वह कुछ दिनों में ग्रह लौट आयेगा.

source: He was destined never to meet her again.
hi: उसके नसीब में उससे फिरसे मिलना नहीं लिखा हुआ था।

source: He will return within 3 hours.
hi: वह तीन घंटों में वापस आएगा।

source: He is always here between 5 and 6 o'clock.
hi: वह हमेशा यहाँ पाँच से छः बजे के बीच होता है।

source: He became a member of this club five years ago.
hi: वह इस क्लब का सदस्य पाँच साल पहले बना था।

source: He must be over sixty.
hi: वे कम-से-कम साठ बरस के तो होंगे।

source: He lives in that house over there.
hi: वह वहाँ उस घर में रहता है।

source: Did he tell you anything?
hi: उसने तुम्हें कुछ बताया क्या?

source: He doesn't understand you.
hi: वह तुम्हें समझता नहीं है।

source: He can't run very fast.
hi: वह ज़्यादा तेज़ नहीं भाग सकता।

source: He couldn't run very fast.
hi: वह ज़्यादा तेज़ नहीं भाग सकता था।

source: He does not seem to be very tired.
hi: वह ज़्यादा थका हुआ नहीं लग रहा।

source: He came back from America.
hi: वह अमरीका से वापस आ गया।

source: He took advantage of every opportunity he had.
hi: उसने किसी भी मौके को हाथ से जाने नहीं दिया।

source: He earns a good salary.
hi: वह अच्छा कमा लेता है।

source: He was born in a small town in Italy.
hi: वह इटली के एक छोटे से गाँव में पैदा हुआ था।

source: He is an Italian.
hi: वह इतालवी है।

source: He kept on crying.
hi: वह रोता रहा।

source: He's always running short of cash.
hi: उसको हमेशा पैसों की कमी होती है।

source: He is always losing his umbrella.
hi: वह हमेशा अपना छाता खोता रहता है।

source: He's always late for class.
hi: वह क्लास में हमेशा देर से आता है।

source: He is always joking.
hi: वह हर वक़्त मज़ाक करता रहता है।

source: He is always speaking to her in whisper.
hi: वह हमेशा उसके साथ फुसफुसाकर बात करता रहता है।

source: When did he come back from Osaka?
hi: वह ओसाका से वापस कब आया?

source: When did he return from Osaka?
hi: वह ओसाका से कब लौटा?

source: He put down the rebellion in India.
hi: उसने भारत में विद्रोह को रोका।

source: He is a nice man, except that he talks too much.
hi: वह आदमी तो भला है, पर बात बहुत ज़्यादा करता है।

source: He was hard up.
hi: उसको पैसों की कमी थी।

source: He was arrested because he stole the money.
hi: उसे पैसे चुराने के लिए गिरफ़्तार कर लिया गया।

source: He gave me this in return.
hi: उसने मुझे बदले में यह दिया।

source: He eats lunch at a cafeteria.
hi: वह कैनटीन में लन्च खाता है।

source: He saw a pretty girl.
hi: उसने एक सुंदर लड़की को देखा।

source: He did not die of cancer.
hi: वह कैंसर से नहीं मरा।

source: He is sure to come.
hi: वह ज़रूर आएगा।

source: He can run the fastest in the class.
hi: पूरी कक्षा में वह सबसे तेज दौड़ सकता है।

source: He took a picture of the koala.
hi: उसने कोआले की तस्वीर खींची।

source: He was buried in this graveyard.
hi: उसको इस कब्रिस्तान में बरी किया गया था।

source: He wants these shirts washed.
hi: उसे ये कमीज़ें धुलवानीं हैं।

source: He plays soccer.
hi: वह फुट‍बॉल खेलता है।

source: He likes playing soccer.
hi: उसको फ़ुटबॉल खेलना अच्छा लगता है।

source: He is anxious to know the result of the test.
hi: वह टेस्ट के नतीजे को जानने के लिए बेचैन है।

source: He contracted malaria while living in the jungle.
hi: जंगल में रहते समय उसे मलेरिया हो गया।

source: He is smelling the soup.
hi: वह सूप को सूँघ रहा है।

source: I thought that he had already finished the work.
hi: मुझे लगा कि वह काम खतम कर चुका था।

source: He is said to know a lot about Spain.
hi: कहते है वह स्पेन के बारे में बहुत कुछ जानता है।

source: He has mania for sports cars.
hi: वह स्पोर्ट्स गाड़ियों के बारे में पागल है।

source: He was caught in the act of pickpocketing.
hi: वह जेब काटते हुए पकड़ा गया।

source: He paid at most ten thousand dollars.
hi: उसने ज़्यादा-से-ज़्यादा दस हज़ार डॉलर खर्चे होंगे।

source: He didn't go there. Neither did I.
hi: न वह वहाँ गया, न मैं।

source: He lived there all by himself.
hi: वह वहां अकेले से रहा।

source: Did he go there?
hi: वह वहाँ गया क्या?

source: He was afraid to go there.
hi: वह वहाँ जाने से डरता था।

source: He is anxious about the result.
hi: वह नतीजे के लिए बेचैन है।

source: He succeeded in climbing the mountain.
hi: वह पहाड़ पर चढ़ने में कामयाब हो गया।

source: He rescued the child from the fire.
hi: उसने बच्चे को आग से बचाया।

source: He had nothing to do with the case.
hi: उसका इस केस के साथ कोई लेना-देना नहीं था।

source: He witnessed the accident.
hi: उसने दुर्घटना को अपनी आँखों से देखा था।

source: He concealed the fact from me.
hi: उसने मुझसे वह बात छिपाई।

source: He was then a boy of ten.
hi: वह दस साल का लड़का था।

source: He looked into the boy's eyes.
hi: उसने लड़के की आँखों में देखा।

source: He worked hard in order to get the prize.
hi: उसने इनाम पाने के लिए कड़ी मेहनत की।

source: He adopted the new method.
hi: उसने वह नया तरीका अपनाया।

source: He defeated his opponent in the election.
hi: उसने चुनाव में अपने विरोधी को हरा दिया।

source: He threw the big man down.
hi: उसने बड़े आदमी को पटक दिया।

source: He stuck the broken pieces together.
hi: उसने टूटे हुए टुकड़ों को वापस जोड़ा।

source: He knocked at the closed door.
hi: उसने बंद दरवाज़े पर खटखटाया।

source: He wanted to buy the book.
hi: वह किताब को खरीदना चाह्ता था।

source: He hid behind the tree.
hi: वह पेड़ के पीछे छुप गया।

source: What was his motive for doing it?
hi: उसका यह करने में उद्देश्य क्या था?

source: What a lucky person he is!
hi: वह कितना नसीबवाला है!

source: He usually comes home late.
hi: वह आमतौर पर घर देर से आता है।

source: He is powerful.
hi: वह शक्तिशाली है।

source: He decided to quit smoking.
hi: उसने सिगरेट पीना छोड़ने का फ़ैसला किया।

source: He sold his own car without hesitation.
hi: उसने अपनी गाड़ी बिना हिचकिचाहट हे बेच दी।

source: He hesitated for a moment.
hi: उसने थोड़ी देर हिचकिचाया।

source: He is good at playing tennis.
hi: वह टेनिस अच्छा खेलता है।

source: He can play tennis.
hi: वह टेनिस खेल सकता है।

source: He opened the door.
hi: उसने दरवाज़ा खोला.

source: He knocked at the door.
hi: उसने दरवाज़े पर खटखटाया।

source: He prefers French to German.
hi: उसे फ़्रानसीसी जर्मन से ज़्यादा अच्छी लगती है।

source: He will not listen to me.
hi: वह मेरी बात नहीं सुनेगा।

source: How did he earn his daily bread?
hi: वह अपनी रोज़ी रोटी कैसे कमाता था?

source: He told me where to go.
hi: उसने मुझे बताया कहाँ जाना है।

source: He asked a very good question.
hi: उसने एक बहुत अच्छा सवाल पूछा।

source: He can be reliable in that he is very patient.
hi: उसके सब्र पर भरोसा किया जा सकता है।

source: He looks very tired.
hi: वह बहुत थका-हारा सा लगता है।

source: He is Tony.
hi: वह टोनी है।

source: He likes all kinds of sports.
hi: उसे सब तरह के खेल पसंद है |

source: I know why he did it.
hi: मुझे पता है उसने क्यों किया था।

source: How fast he runs!
hi: देखो वह कितना तेज़ दौड़ता है!

source: He patted me on the shoulder with a smile.
hi: उसने मेरी पीठ पर थपथपाया और मुस्कुराया।

source: He was accused of theft.
hi: उसपर चोरी का इलज़ाम लगाया गया।

source: He decided not to go to the party.
hi: उसने पार्टी में न जाने का फ़ैसला किया।

source: Did he come by bus or by train?
hi: वो बस से आया था कि ट्रेन से?

source: He closed the door suddenly.
hi: उसने अचानक से दरवाज़ा बंद किया।

source: He lost his balance and fell off his bicycle.
hi: उसने अपना संतुलन खो दिया और वह अपनी साईकल पर से गिर गया।

source: He spread butter on the bread.
hi: उसने मक्खन को ब्रेड पर लगाया।

source: He called for another glass of beer.
hi: उसने और एक दारु की ग्लास मंगवाई.

source: He is brave enough to go there by himself.
hi: वह वहाँ अकेले जाने लायक बहादुर है।

source: He has his hair cut once a month.
hi: वह अपने बाल महीने में एक बार कटवाता है।

source: He took Bill swimming.
hi: वह बिल को तैरने ले गया।

source: He is captain of the football team.
hi: वह फ़ुटबॉल टीम का कप्तान है।

source: He doesn't speak French, neither do I.
hi: न उसको फ़्रानसीसी बोलनी आती है न मुझे।

source: He's not at all afraid of snakes.
hi: वह सापोंं से बिलकुल भी नहीं डरता।

source: He thrust the money into his pocket.
hi: उसने पैसे अपनी जेब में ठूसे।

source: He came here again.
hi: वह यहाँ फिर आया था।

source: He is ashamed that he has failed again.
hi: उसको अपने फिरसे फ़ेल हो जाने पर शर्मिन्दगी महसूस हो रही है।

source: He hasn't written the letter yet.
hi: उसने चिट्ठी अभी तक नहीं लिखी है।

source: He still wants to come.
hi: वह फिर भी आना चाहता है।

source: He cried as if he were a boy of six.
hi: उसने छः बरस के बच्चे की तरह रोया।

source: They made fun of Mary.
hi: उन्होंने मेरी का मज़ाक उड़ाया।

source: He will soon come back.
hi: वह बस अभी आता होगा।

source: He's already left.
hi: वह जाचुका है।

source: He entered the room slowly by that door.
hi: वह उस दरवाज़े से धीरे से कमरे में घुसा।

source: He will write for hours at a time.
hi: वह एक बार में घंटो के लिए लिख सकता है।

source: He often plays the guitar.
hi: वह अक्सर गिटार बजाता है।

source: He went to Rome, where he saw a lot of old buildings.
hi: वह रोम गया, जहां उसे कई पुरानी इमारतें दिखीं।

source: He can both speak and write Russian.
hi: वह रूसी बोलना और लिखना दोनो जानता है।

source: He dearly loves his school.
hi: उसे अपना स्कूल बहुत पसंद है।

source: He left all his property to his wife in his will.
hi: उसने वसीयत में अपनी पत्नी को सारी जायदाद छोड़ दी।

source: He was a great poet as well as a doctor.
hi: वह एक महान कवि ही नहीं बल्कि एक डॉक्टर भी थे।

source: He wishes to become a doctor.
hi: उसकी डॉक्टर बनने की अभिलाषा है।

source: He abandoned his hope of becoming a doctor.
hi: उसने डॉक्टर बन ने की उम्मीद त्याग दी.

source: He likes to take a solitary walk.
hi: उसको अकेले सैर पर जाना पसंद है।

source: He was killed by a single bullet.
hi: उसे केवल एक गोली से मारा गया था।

source: He learned how to swim.
hi: उसने तैरना सीखा।

source: He can't swim.
hi: उसे तैरना नहीं आता।

source: He cannot speak English, much less German.
hi: जर्मन तो छोड़ो वह तो अंग्रेज़ी भी नहीं बोल सकता।

source: Does he speak English?
hi: वह अंग्रेज़ी बोलता है क्या?

source: He is busy learning English.
hi: वह अंग्रेज़ी सीखने में व्यस्त है।

source: He began to learn English.
hi: उसने अंग्रेज़ी सीखना शुरू किया।

source: He can't speak English, much less French.
hi: फ़्रेंच तो छोड़ो वह तो अंग्रेज़ी भी नहीं बोल सकता।

source: He is a British citizen, but lives in India.
hi: वह अंग्रेज़ी नागरिक है पर भारत में रहता है।

source: He arrived at the station.
hi: वह स्टेशन पहु्ँचा।

source: He was more than a king.
hi: वह एक राजा से बहुत ज़्यादा था।

source: He is very fond of music.
hi: वह संगीत का बहुत शौकीन है।

source: He was able to do everything at will.
hi: वह जो भी करना चाहता था कर सकता था।

source: He had to go without food for days.
hi: उसने दिनों तक खाना नहीं खाया।

source: He deals in furniture.
hi: वो फ़र्निचर का व्यापार करता है।

source: He can imitate the rest of the family.
hi: वह अपने सारे घरवालों की नकल उतार सकता है।

source: He worked hard in order that his family might live in comfort.
hi: वह अपने परिवार के सुख के लिए बहुत मेहनत करता था।

source: He abandoned his family.
hi: उसने अपने परिवार को छोड़ दिया।

source: He sang while working.
hi: उसने गाते गाते काम किया।

source: He came singing a song.
hi: वह गाना गाते हुए आया।

source: He bade us welcome.
hi: उसने हमारा स्वागत किया।

source: He embezzled the money from his office.
hi: उसने अपने दफ़तर के पैसों को गबन किया।

source: He was walking toward the sea.
hi: वह समुंदर की ओर चल रहा था।

source: He made up his mind to study abroad.
hi: उसने विदेश में पढ़ने का निर्णय लिया।

source: He studied abroad.
hi: उसने विदेश में पढ़ाई करी थी।

source: He decided to go abroad.
hi: उसने विदेश जाने का निर्णय लिया।

source: He has gone out.
hi: वे बाहर गये हैं।

source: They defended their country against the invaders.
hi: उन्होंने अपने देश का आक्रमकों से संरक्षण किया।

source: He has a beard.
hi: उसके पास दाढ़ी है।

source: He is not the sort of guy who gives in easily.
hi: वह आसानी से मान जाने वाला आदमी नहीं है।

source: He is afraid of making mistakes.
hi: वह ग़लती करने से डरता है।

source: He asked our pardon for making a mistake.
hi: उसने ग़लती करने के लिए हमसे माफ़ी माँगी।

source: He knows a lot of people.
hi: वह बहुत सारे लोगों को जानता है।

source: He had to go through a lot of hardships.
hi: उसे बहुत सारे कष्ट सहने पड़े थे।

source: He is hard to please.
hi: उसको खुश करना बहुत मुश्किल है।

source: He pledged to marry me when he returned home.
hi: घर लौटने पर मुझसे शादी करने की उसने प्रतिज्ञा की थी।

source: He broke himself of the bad habit of smoking.
hi: उसने अपनी सिगरेट पीने की बुरी आदत छोड़ दी।

source: He broke one of the bones in his leg.
hi: उसने अपने पैर की एक हड्डी तोड़ ली।

source: He cried and cried.
hi: वह रोया और और रोया।

source: He tried to give up smoking last year, but it was in vain.
hi: उसने पिछले साल सिगरेट पीना छोड़ने की कोशीश करी थी पर वह छोड़ नहीं पाया।

source: He began to shout.
hi: वह चिल्लाने लगा।

source: He's strong.
hi: वह ताकतवर है।

source: He was lying on his back, looking at the sky.
hi: वह अपनी पीठ पर लेटकर आसमान को देख रहा था।

source: He is getting along with his employees.
hi: वह अपने कर्मचारियों के साथ अच्छे से निभता है।

source: He married for money.
hi: उसने पैसों के लिए शादी की।

source: Though he is rich, he is not happy.
hi: वह अमीर हो कर भी ख़ुश नहीं है।

source: It seems that he is rich.
hi: ऐसा लगता है कि वह अमीर है।

source: He has plenty of money in the bank.
hi: उसके पास बैंक में बहुत पैसे हैं।

source: He was looking at the sky.
hi: वह आसमान की ओर देख रहा था।

source: He looked up at the sky.
hi: उसने आसमान की तरफ़ देखा।

source: He is angry with you.
hi: वह तुमसे नाराज़ है।

source: He was sentenced to death.
hi: उसे मौत की सज़ा दे दी गई।

source: He was sent to prison.
hi: उसे जेल भेजा गया।

source: He ran faster than his brother did.
hi: वह अपने भाई से तेज़ भागता था।

source: He realized his dream of becoming an artist.
hi: उसका कलाकार बनने का सपना सच हो गया।

source: He will never admit his fault.
hi: वह कभी भी अपनी गलती नहीं स्वीकारेगा।

source: He never speaks of his own job.
hi: वह अपने काम के बारे में कभी बात नहीं करता।

source: I am of the opinion that he will never come back.
hi: मेरे ख़याल से वह कभी भी वापस नहीं आएगा।

source: He went to New York on Monday.
hi: वह सोमवार को न्यूयॉर्क चला गया।

source: His health has enabled him to succeed in life.
hi: उसके स्वास्थ्य ने उसको ज़िन्दगी में कामयाब होने दिया है।

source: He worked very hard, but could make little progress.
hi: उसने कड़ी मेहनत की, मगर वह थोड़ी ही तरक्की कर पाया।

source: He struck me in the face with his fist.
hi: उसने मुझे मुँह पर घूँसा मारा।

source: He tried in vain to open the locked door.
hi: वह बंद दरवाज़े को खोल नहीं पाया।

source: He saw a dog near the door.
hi: उसने दरवाज़े के पास एक कुत्ता देखा।

source: He had nothing to say, so he went away.
hi: उसके पास कुछ भी कहने को नहीं था, तो वह चला गया।

source: He did it as he had been told.
hi: उसने वैसा करा जैसे उसे बताया गया था।

source: He made up an excuse.
hi: उसने कोई बहाना बना लिया।

source: He's reading a novel now.
hi: वह अभी एक उपन्यास पढ़ रहा है।

source: He wants to play soccer this afternoon.
hi: वह आज दोपहर फुटबॉल खेलना चाहता है।

source: He may come today.
hi: वह आज आ सकता है।

source: When he is in trouble, he always turns to his sister for help.
hi: जब वह मुश्किलों में पड़ता है, वह हमेशा अपनी बहन से मदद माँगता है।

source: He is used to hard work.
hi: उसको मेहनत करने की आदत है।

source: Do you think he will be elected president again?
hi: क्या तुम्हे लगता है वह फिरसे प्रेसीडेंट चुना जाएगा?

source: He reminded his wife to wake him up at 7:00 a.m.
hi: उसने अपनी पत्नी को उसे सुबह सात बजे उठाने की बात का याद दिलाया।

source: He took great care, yet he made a mistake.
hi: उसने बहुत ध्यान लगाकर काम किया, पर फिर भी ग़लती कर बैठा।

source: He read this book yesterday.
hi: उसने यह किताब कल पढ़ी थी।

source: He died yesterday.
hi: वह कल मर गया।

source: He visited Kyoto last year.
hi: वह पिछले साल क्योटो गया था।

source: He changed schools last year.
hi: उसने पिछले साल स्कूल बदला था।

source: He was accused of murder.
hi: उसपर कत्ल का इलज़ाम लगाया गया।

source: He has been to London three times.
hi: वह लंदन तीन बार जा चुका है।

source: As soon as he finished his work, he went home.
hi: वह अपना काम खतम करते ही घर चला गया।

source: He earns more money than he can spend.
hi: वह ज़रूरत से ज़्यादा पैसे कमाता है।

source: He will not permit his children to sit up late.
hi: वह अपने बच्चों को रात में देर से जागने नहीं देगा।

source: He gave his children a good education.
hi: उसने अपने बच्चों को अच्छी शिक्षा दी।

source: He didn't fear death.
hi: वह मृत्यु से डरता नहीं था।

source: He believes whatever I say.
hi: मैं जो भी कहता हूँ वह मेरा यकीन कर लेता है।

source: He responded to the signal I gave.
hi: उसने मेरे इशारे का जवाब दिया।

source: He wouldn't allow me to drive his car.
hi: उसने मुझे उसकी गाड़ी नहीं चलाने दी।

source: He did the reverse of what I asked.
hi: उसने मेरे बताए हुए से उलटा काम किया।

source: He knows us very well.
hi: वह हमको अच्छी तरह से जानता है।

source: He seems to know us.
hi: लगता है वह हमें जानता है।

source: He is an ideal husband for me.
hi: वह मेरे लिए आदर्श पति है।

source: He used to tell me stories about India.
hi: वह मुझे भारत के बारे में कहानियाँ सुनाया करता था।

source: He explained the rule to me.
hi: उसने मुझे वह नियम समझाया।

source: He came to see me.
hi: वह मुझसे मिलने आया था।

source: He asked me if I could do him a favor.
hi: उसने मुझसे एक एहसान माँगा।

source: He asked me for some money.
hi: उसने मुझसे थोड़े पैसे माँगे।

source: He promised me that he would be more careful in the future.
hi: उसने मुझसे वादा किया था कि वह आगे से ज़्यादा सावधान रहेगा।

source: He taught me how to write.
hi: उसने मुझे लिखना सिखाया।

source: He raised a weapon against me.
hi: उसने मेरे खिलाफ़ हथियार उठाया।

source: He said he would write to me, but he hasn't.
hi: उसने कहा था कि वह मुझे चिट्ठी लिखेगा, पर उसने अभी तक एक भी चिट्ठी नहीं भेजी है।

source: He lent me two books.
hi: उसने मुझे दो किताबें उधार दीं।

source: He asked a favor of me.
hi: उसने मुझसे एहसान मांगा।

source: He isn't my cousin.
hi: वह मेरा चचेरा भाई नहीं है।

source: He asked my pardon.
hi: उसने मुझसे माफ़ी माँगी।

source: He doesn't live in my neighborhood.
hi: वह मेरे आस-पड़ोस में नहीं रहता।

source: He was my dear friend.
hi: वह मेरा अच्छा दोस्त था।

source: He envied my success.
hi: उसको मेरी कामयाबी से जलन थी।

source: He went there instead of me.
hi: वह मेरे बजाय वहां गया।

source: He took advantage of my youth.
hi: उसने मेरे जवान होने का फ़ायदा उठाया।

source: He entered my room.
hi: वह मेरे कमरे में आया।

source: He seemed surprised by my ignorance.
hi: उसने मेरे अज्ञान पर आशंका जताई।

source: He is my friend.
hi: वह मेरा दोस्त है।

source: He lives next to me.
hi: वह मेरे पड़ोस में रहता है।

source: He speaks English better than I do.
hi: वह अंग्रेज़ी मुझसे अच्छा बोलता है।

source: He took me for an Englishman.
hi: वह मुझे अंग्रेज़ समझ बैठा।

source: The moment he saw me he ran away.
hi: जिस क्षण उसने मुझे देखा, वह भाग गया।

source: He came here to help me.
hi: वह यहाँ मेरी मदद करने आया।

source: He treats me like his slave.
hi: वह मुझसे ग़ुलाम की तरह बर्ताव करता है।

source: He charged me with dishonesty.
hi: उसने मुझ पर बेईमानी का दोष लगाया।

source: He failed to come up to our expectations.
hi: वह हमारी उम्मीदों को पूरा नहीं कर पाया।

source: He kept us waiting for a long time.
hi: उसने हमसे बहुत देर तक इंतेज़ार करवाया।

source: He failed in the examination.
hi: वह परीक्षा में फ़ेल हो गया।

source: He is confident that he will pass the examination.
hi: उसको यकीन है कि वह परीक्षा में पास हो जाएगा।

source: He occasionally visited me.
hi: वह कभी-कभार मुझसे मिलने आता था।

source: He comes to meet me sometimes.
hi: वह कभी-कभार मुझसे मिलने आता है।
